MbsLookup.xml

<?xml version="1.0" encoding="ISO-8859-1"?>
<wsdl:definitions targetNamespace="http://www.barnesandnobleinc.com/mbs/services/MbsLookup" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:apachesoap="http://xml.apache.org/xml-soap" xmlns:impl="http://www.barnesandnobleinc.com/mbs/services/MbsLookup" xmlns:intf="http://www.barnesandnobleinc.com/mbs/services/MbsLookup" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns1="urn:MbsLookup" xmlns:tns2="http://data.locator.bninc" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsdlsoap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><wsdl:types><schema targetNamespace="http://xml.apache.org/xml-soap" xmlns="http://www.w3.org/2001/XMLSchema"><import namespace="http://schemas.xmlsoap.org/soap/encoding/"/><complexType name="mapItem"><sequence><element name="key" nillable="true" type="xsd:string"/><element name="value" nillable="true" type="xsd:string"/></sequence></complexType><complexType name="Map"><sequence><element maxOccurs="unbounded" minOccurs="0" name="item" type="apachesoap:mapItem"/></sequence></complexType></schema><schema targetNamespace="http://data.locator.bninc" xmlns="http://www.w3.org/2001/XMLSchema"><import namespace="http://schemas.xmlsoap.org/soap/encoding/"/><complexType name="Contributor"><sequence><element name="firstName" nillable="true" type="xsd:string"/><element name="lastName" nillable="true" type="xsd:string"/></sequence></complexType><complexType name="EventMapping"><sequence><element name="bksEventId" nillable="true" type="xsd:long"/><element name="bnbnEventId" nillable="true" type="xsd:string"/><element name="externalId" nillable="true" type="xsd:long"/><element name="externalSource" nillable="true" type="xsd:string"/><element name="key" nillable="true" type="xsd:anyType"/><element name="startDate" nillable="true" type="xsd:dateTime"/><element name="store" nillable="true" type="xsd:long"/></sequence></complexType><complexType name="Event"><sequence><element name="calendarMap" nillable="true" type="apachesoap:Map"/><element name="contributors" nillable="true" type="impl:ArrayOf_tns2_Contributor"/><element name="contributorsSet" nillable="true" type="xsd:anyType"/><element name="dotcomEvent" nillable="true" type="tns2:EventMapping"/><element name="endDate" nillable="true" type="xsd:dateTime"/><element name="eventDetailParams" nillable="true" type="apachesoap:Map"/><element name="eventId" nillable="true" type="xsd:long"/><element name="eventInfo" nillable="true" type="xsd:string"/><element name="eventName" nillable="true" type="xsd:string"/><element name="eventScheduleMsgFlag" nillable="true" type="xsd:string"/><element name="eventTypeForEventDetail" nillable="true" type="xsd:string"/><element name="fullEventLocation" nillable="true" type="xsd:string"/><element name="genre" nillable="true" type="xsd:string"/><element name="imgPath" nillable="true" type="xsd:string"/><element name="key" nillable="true" type="xsd:anyType"/><element name="markForDelete" nillable="true" type="xsd:string"/><element name="repeating" type="xsd:boolean"/><element name="sku" nillable="true" type="xsd:string"/><element name="skuType" nillable="true" type="xsd:int"/><element name="startDate" nillable="true" type="xsd:dateTime"/><element name="store" nillable="true" type="tns1:Store"/><element name="type" nillable="true" type="xsd:string"/></sequence></complexType></schema><schema targetNamespace="http://www.barnesandnobleinc.com/mbs/services/MbsLookup" xmlns="http://www.w3.org/2001/XMLSchema"><import namespace="http://schemas.xmlsoap.org/soap/encoding/"/><complexType name="ArrayOf_tns2_Contributor"><complexContent><restriction base="soapenc:Array"><attribute ref="soapenc:arrayType" wsdl:arrayType="tns2:Contributor[]"/></restriction></complexContent></complexType><complexType name="ArrayOf_tns1_Proximity"><complexContent><restriction base="soapenc:Array"><attribute ref="soapenc:arrayType" wsdl:arrayType="tns1:Proximity[]"/></restriction></complexContent></complexType></schema><schema targetNamespace="urn:MbsLookup" xmlns="http://www.w3.org/2001/XMLSchema"><import namespace="http://schemas.xmlsoap.org/soap/encoding/"/><complexType name="Store"><sequence><element name="address1" nillable="true" type="xsd:string"/><element name="address2" nillable="true" type="xsd:string"/><element name="city" nillable="true" type="xsd:string"/><element name="closeDate" nillable="true" type="xsd:dateTime"/><element name="division" nillable="true" type="xsd:string"/><element name="formattedOpenDate" nillable="true" type="xsd:string"/><element name="formattedStoreId" nillable="true" type="xsd:string"/><element name="hours" nillable="true" type="xsd:string"/><element name="key" nillable="true" type="xsd:anyType"/><element name="name" nillable="true" type="xsd:string"/><element name="openDate" nillable="true" type="xsd:dateTime"/><element name="openDateNote" nillable="true" type="xsd:string"/><element name="phone" nillable="true" type="xsd:string"/><element name="quickDirections" nillable="true" type="xsd:string"/><element name="state" nillable="true" type="xsd:string"/><element name="storeId" nillable="true" type="xsd:long"/><element name="storeName" nillable="true" type="xsd:string"/><element name="zipcode" nillable="true" type="xsd:string"/></sequence></complexType><complexType name="Proximity"><sequence><element name="distance" nillable="true" type="xsd:float"/><element name="event" nillable="true" type="tns2:Event"/><element name="store" nillable="true" type="tns1:Store"/></sequence></complexType></schema></wsdl:types>
  <wsdl:message name="getStatusResponse">
    <wsdl:part name="getStatusReturn" type="xsd:string"/>
  </wsdl:message>
  <wsdl:message name="findStoresResponse">
    <wsdl:part name="findStoresReturn" type="impl:ArrayOf_tns1_Proximity"/>
  </wsdl:message>
  <wsdl:message name="findStoresRequest">
    <wsdl:part name="zipcode" type="xsd:string"/>
  </wsdl:message>
  <wsdl:message name="getStatusRequest">
  </wsdl:message>
  <wsdl:portType name="MbsLookup">
    <wsdl:operation name="getStatus">
      <wsdl:input message="impl:getStatusRequest" name="getStatusRequest"/>
      <wsdl:output message="impl:getStatusResponse" name="getStatusResponse"/>
    </wsdl:operation>
    <wsdl:operation name="findStores" parameterOrder="zipcode">
      <wsdl:input message="impl:findStoresRequest" name="findStoresRequest"/>
      <wsdl:output message="impl:findStoresResponse" name="findStoresResponse"/>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="MbsLookupSoapBinding" type="impl:MbsLookup">
    <wsdlsoap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="getStatus">
      <wsdlsoap:operation soapAction=""/>
      <wsdl:input name="getStatusRequest">
        <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://ws.locator.bninc" use="encoded"/>
      </wsdl:input>
      <wsdl:output name="getStatusResponse">
        <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://www.barnesandnobleinc.com/mbs/services/MbsLookup" use="encoded"/>
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="findStores">
      <wsdlsoap:operation soapAction=""/>
      <wsdl:input name="findStoresRequest">
        <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://ws.locator.bninc" use="encoded"/>
      </wsdl:input>
      <wsdl:output name="findStoresResponse">
        <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://www.barnesandnobleinc.com/mbs/services/MbsLookup" use="encoded"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="MbsLookupService">
    <wsdl:port binding="impl:MbsLookupSoapBinding" name="MbsLookup">
      <wsdlsoap:address location="http://www.barnesandnobleinc.com/mbs/services/MbsLookup"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>