MbsLookupSoapBinding.getStatus.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns2="http://xml.apache.org/xml-soap"
 xmlns:ns3="http://data.locator.bninc"
 xmlns:ns4="urn:MbsLookup"
 xmlns:ns5="http://ws.locator.bninc">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns5:getStatus>
  </ns5:getStatus>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
